myinit.org
;; -*- lexical-binding: t; -*-
#+STARTUP: fold

* Emacs Configuration

** Core Settings
*** Custom File
Set up a separate file for Customize-recorded settings, keeping this config clean.

#+begin_src emacs-lisp
(setq custom-file "~/.emacs-custom.el")
(load custom-file)
#+end_src

*** Fonts
#+begin_src emacs-lisp
(set-face-attribute 'default nil
                    :font "JetBrains Mono"
                    :weight 'light
                    :height 140)

(set-face-attribute 'fixed-pitch nil
                    :font "JetBrains Mono"
                    :weight 'light
                    :height 140)

(set-face-attribute 'variable-pitch nil
                    :font "Iosevka Light"
                    :weight 'light
                    :height 140)
#+end_src

*** UI Cleanup
Hide chrome, silence the bell, and configure basic display settings.

#+begin_src emacs-lisp
(setq inhibit-startup-message t)
(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode 0)
(set-fringe-mode 10)
(show-paren-mode 1)
(setq ring-bell-function #'ignore)
(setq use-dialog-box nil)
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

*** Display & Editing Defaults
#+begin_src emacs-lisp
(setq-default fill-column 72
              tab-width 4
              indent-tabs-mode nil)
(global-visual-line-mode t)
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
(global-hl-line-mode t)
(setq disabled-command-function nil)
(setq echo-keystrokes 0.5)
(setq help-window-select t)
(setq frame-title-format
      '("" invocation-name ": "
        (:eval (replace-regexp-in-string "^ +" "" (buffer-name)))))
#+end_src

*** Encoding
#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
(set-language-environment "UTF-8")
#+end_src

*** Backup & Auto-Save
All backup and auto-save files are directed to dedicated directories.

#+begin_src emacs-lisp
(make-directory "~/.emacs.d/autosave/" t)
(make-directory "~/.emacs.d/backups/" t)

(setq backup-directory-alist '((".*" . "~/.emacs.d/backups/")))
(defvar autosave-dir (expand-file-name "~/.emacs.d/autosave/"))
(setq auto-save-list-file-prefix autosave-dir
      auto-save-file-name-transforms `((".*" ,autosave-dir t)))
#+end_src

*** Persistence (recentf, saveplace, savehist)
#+begin_src emacs-lisp
(recentf-mode t)
(setq recentf-save-file "~/.emacs.d/recentf"
      recentf-max-saved-items 50)

(use-package saveplace :straight t
  :init (save-place-mode 1))
(setq save-place-file "~/.emacs.d/saveplace")

(setq savehist-file "~/.emacs.d/savehist"
      history-length 150)

(setq auto-revert-use-notify nil)
(global-auto-revert-mode 1)
#+end_src

*** Uniquify Buffer Names
Disambiguate buffers with the same filename using their directory path.

#+begin_src emacs-lisp
(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)
#+end_src

*** Auto-Compile
Ensures Emacs never loads outdated byte-compiled files.

#+begin_src emacs-lisp
(use-package auto-compile :straight t)
(setq load-prefer-newer t)
(add-to-list 'load-path "~/.emacs.d/straight/repos/auto-compile")
(require 'auto-compile)
(auto-compile-on-load-mode)
(auto-compile-on-save-mode)
#+end_src

*** Miscellaneous
#+begin_src emacs-lisp
;; Print via CUPS
(setq lpr-command "gtklp"
      ps-lpr-command "gtklp")

;; Fix oh-my-zsh eterm color issue
(setq system-uses-terminfo nil)

;; Dictionary
(setq dictionary-server "dict.org")
#+end_src

*** Shell PATH
Set =exec-path= and =PATH= explicitly so Emacs can find executables like
=jupyter= regardless of how it was launched. The direct path is set first
(before any packages load) so nothing misses it during init.

#+begin_src emacs-lisp
;; Set these paths explicitly and early — before any packages load.
;; /usr/local/bin  — jupyter, ruff
;; ~/.local/bin    — black (installed via pip install --user)
(dolist (path '("/usr/local/bin" "/home/rob/.local/bin"))
  (add-to-list 'exec-path path))
(setenv "PATH" (concat "/usr/local/bin:/home/rob/.local/bin:" (getenv "PATH")))

;; exec-path-from-shell syncs the rest of the shell PATH for completeness.
(use-package exec-path-from-shell :straight t
  :config
  (exec-path-from-shell-initialize))
#+end_src

** Appearance
*** Theme
#+begin_src emacs-lisp
(use-package modus-themes :straight t :defer t)
(use-package doom-themes  :straight t :defer t)
(use-package spacegray-theme :straight t :defer t)

(setq modus-themes-common-palette-overrides
      '((border-mode-line-active unspecified)
        (border-mode-line-inactive unspecified)))

(setq modus-themes-headings
      '((1 . (variable-pitch 1.5))
        (2 . (1.3))
        (3 . (1.2))
        (4 . (1.1))
        (agenda-date . (1.3))
        (agenda-structure . (variable-pitch light 1.8))
        (t . (1.1))))

(setq modus-themes-org-blocks 'gray-background)
(load-theme 'modus-vivendi t)
#+end_src

*** Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :straight t
  :if (display-graphic-p))

(use-package nerd-icons
  :straight t
  :config
  (setq nerd-icons-font-family "Symbols Nerd Font Mono"))

#+end_src

*** Mode Line
#+begin_src emacs-lisp
(use-package doom-modeline
  :straight t
  :init (doom-modeline-mode 1))

(setq doom-modeline-height 40
      doom-modeline-env-enable-python nil)
(display-time-mode 1)
(setq display-time-format "%I:%M:%S"
      display-time-interval 1)

(use-package minions
  :straight t
  :config
  (minions-mode 1)
  (keymap-global-set "<f7>" #'minions-minor-modes-menu))
#+end_src

** Completion Framework
*** Vertico
#+begin_src emacs-lisp
(straight-use-package '(vertico :files (:defaults "extensions/*")
                         :includes (vertico-buffer
                                    vertico-directory
                                    vertico-flat
                                    vertico-indexed
                                    vertico-mouse
                                    vertico-quick
                                    vertico-repeat
                                    vertico-reverse)))
(vertico-mode)

(use-package savehist :straight t :init (savehist-mode))

(use-package emacs :straight t
  :init
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  (setq completion-cycle-threshold 3
        tab-always-indent 'complete
        enable-recursive-minibuffers t))
#+end_src

*** Orderless
#+begin_src emacs-lisp
(use-package orderless :straight t
  :init
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src

