myinit.org
*** Consult
#+begin_src emacs-lisp
(use-package consult :straight t
  :bind (("C-c h"   . consult-history)
         ("C-c m"   . consult-mode-command)
         ("C-c k"   . consult-kmacro)
         ("C-x M-:" . consult-complex-command)
         ("C-x b"   . consult-buffer)
         ("C-x 4 b" . consult-buffer-other-window)
         ("C-x 5 b" . consult-buffer-other-frame)
         ("C-x r b" . consult-bookmark)
         ("C-x p b" . consult-project-buffer)
         ("M-#"     . consult-register-load)
         ("M-'"     . consult-register-store)
         ("C-M-#"   . consult-register)
         ("M-y"     . consult-yank-pop)
         ("M-g e"   . consult-compile-error)
         ("M-g f"   . consult-flymake)
         ("M-g g"   . consult-goto-line)
         ("M-g M-g" . consult-goto-line)
         ("M-g o"   . consult-outline)
         ("M-g m"   . consult-mark)
         ("M-g k"   . consult-global-mark)
         ("M-g i"   . consult-imenu)
         ("M-g I"   . consult-imenu-multi)
         ("M-s d"   . consult-find)
         ("M-s D"   . consult-locate)
         ("M-s g"   . consult-grep)
         ("M-s G"   . consult-git-grep)
         ("M-s r"   . consult-ripgrep)
         ("M-s l"   . consult-line)
         ("M-s L"   . consult-line-multi)
         ("M-s k"   . consult-keep-lines)
         ("M-s u"   . consult-focus-lines)
         ("M-s e"   . consult-isearch-history)
         :map isearch-mode-map
         ("M-e"   . consult-isearch-history)
         ("M-s e" . consult-isearch-history)
         ("M-s l" . consult-line)
         ("M-s L" . consult-line-multi)
         :map minibuffer-local-map
         ("M-s" . consult-history)
         ("M-r" . consult-history))
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)
  (advice-add #'register-preview :override #'consult-register-window)
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  :config
  (setq consult-narrow-key "<")
  (with-eval-after-load 'consult
    (consult-customize
     consult-theme
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     :preview-key '(:debounce 0.4 any))))

(use-package consult-lsp :straight t)
#+end_src

*** Marginalia
#+begin_src emacs-lisp
(use-package marginalia :straight t
  :bind (("M-A" . marginalia-cycle)
         :map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  :init (marginalia-mode))
#+end_src

*** Corfu + CAPF (in-buffer completion)
#+begin_src emacs-lisp
(use-package corfu :straight t
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode 1)
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.15)
  (corfu-auto-prefix 2)
  (corfu-cycle t))

(use-package cape :straight t
  :init
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword))

(use-package yasnippet-capf :straight t
  :after (yasnippet)
  :init
  (add-to-list 'completion-at-point-functions #'yasnippet-capf))
#+end_src

*** Embark
#+begin_src emacs-lisp
(use-package embark :straight t
  :bind (("C-."   . embark-act)
         ("C-;"   . embark-dwim)
         ("C-h B" . embark-bindings))
  :init
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package embark-consult :straight t
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

*** Amx
#+begin_src emacs-lisp
(use-package amx :straight t)
#+end_src

** Keybindings
*** Which-key
#+begin_src emacs-lisp
(use-package which-key :straight t
  :config
  (require 'which-key)
  (which-key-mode))
#+end_src

*** Hydra
#+begin_src emacs-lisp
(use-package hydra :straight t)
#+end_src

*** Helpful
#+begin_src emacs-lisp
(use-package helpful :straight t
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command]  . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key]      . helpful-key))
#+end_src

*** Global Keybindings
#+begin_src emacs-lisp
;; Config helpers
(defun config-visit ()
  "Open the Emacs configuration file."
  (interactive)
  (find-file "~/.emacs.d/myinit.org"))
(global-set-key (kbd "C-c e") 'config-visit)

(defun config-reload ()
  "Reload the Emacs configuration file."
  (interactive)
  (org-babel-load-file (expand-file-name "~/.emacs.d/myinit.org")))
(global-set-key (kbd "C-c r") 'config-reload)

;; Buffer & window management
(global-set-key (kbd "<f5>")     'revert-buffer)
(global-set-key (kbd "C-x C-b") 'ibuffer)
(global-set-key (kbd "C-z")     'undo-only)
(global-set-key (kbd "C-S-z")   'undo-redo)
(global-set-key (kbd "M-o")     'ace-window)

;; Search
(global-set-key (kbd "C-|")   'avy-goto-char)
(global-set-key (kbd "C-'")   'avy-goto-char-2)
(global-set-key (kbd "M-g w") 'avy-goto-word-1)
(global-set-key (kbd "M-g e") 'avy-goto-word-0)
(global-set-key (kbd "M-g M-j") 'avy-goto-char-timer)
(global-set-key (kbd "M-g M-c") 'avy-copy-line)
(global-set-key (kbd "M-g M-m") 'avy-move-line)

;; Editing utilities
(global-set-key "\M-y" 'popup-kill-ring)
(global-set-key [remap dabbrev-expand] 'hippie-expand)

;; Lorem ipsum
(global-set-key (kbd "C-c C-i s") 'lorem-ipsum-insert-sentences)
(global-set-key (kbd "C-c C-i p") 'lorem-ipsum-insert-paragraphs)
(global-set-key (kbd "C-c C-i l") 'lorem-ipsum-insert-list)

;; Substitute
(define-key global-map (kbd "M-p s") #'substitute-target-below-point)
(define-key global-map (kbd "M-p r") #'substitute-target-above-point)
(define-key global-map (kbd "M-p d") #'substitute-target-in-defun)
(define-key global-map (kbd "M-p b") #'substitute-target-in-buffer)

;; Visual regexp
(define-key global-map (kbd "C-c s") 'vr/replace)
(define-key global-map (kbd "C-c q") 'vr/query-replace)
(define-key global-map (kbd "C-c j") 'vr/mc-mark)

;; Other
(global-set-key [f8]  'neotree-toggle)
(global-set-key [f10] 'hydra-org/body)
(global-set-key (kbd "<f6>") 'my/copy-idlink-to-clipboard)
(global-set-key (kbd "C-x p i") 'org-cliplink)
#+end_src

*** Ibuffer Configuration
#+begin_src emacs-lisp
(setq ibuffer-saved-filter-groups
      '(("default"
         ("dired"       (mode . dired-mode))
         ("org"         (name . "^.*org$"))
         ("web"         (or (mode . web-mode) (mode . js2-mode)))
         ("shell"       (or (mode . eshell-mode) (mode . shell-mode)))
         ("mu4e"        (name . "\*mu4e\*"))
         ("programming" (or (mode . python-mode) (mode . c++-mode)))
         ("emacs"       (or (name . "^\\*scratch\\*$")
                            (name . "^\\*Messages\\*$"))))))

(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-auto-mode 1)
            (ibuffer-switch-to-saved-filter-groups "default")))

(setq ibuffer-show-empty-filter-groups nil
      ibuffer-expert t)
#+end_src

*** C/C++ Header File Toggle
#+begin_src emacs-lisp
(defvar my-cpp-other-file-alist
  '(("\\.cpp\\'" (".hpp" ".ipp"))
    ("\\.ipp\\'" (".hpp" ".cpp"))
    ("\\.hpp\\'" (".ipp" ".cpp"))
    ("\\.cxx\\'" (".hxx" ".ixx"))
    ("\\.ixx\\'" (".cxx" ".hxx"))
    ("\\.hxx\\'" (".ixx" ".cxx"))
    ("\\.c\\'" (".h"))
    ("\\.h\\'" (".c"))))

(setq-default ff-other-file-alist 'my-cpp-other-file-alist)
(add-hook 'c-mode-hook
          (lambda ()
            (local-set-key (kbd "M-o") #'ff-find-other-file)))
#+end_src

** Navigation & Window Management
*** Ace-window & Avy
#+begin_src emacs-lisp
(use-package ace-window :straight t
  :init
  (global-set-key (kbd "M-o") 'ace-window))

(use-package avy :straight t
  :config
  (avy-setup-default)
  (setq avy-timeout 1.0))
#+end_src

*** Winner Mode
#+begin_src emacs-lisp
(when (fboundp 'winner-mode)
  (winner-mode 1))
#+end_src

*** Neotree
#+begin_src emacs-lisp
(use-package neotree :straight t)
(require 'neotree)
(global-set-key [f8] 'neotree-toggle)
#+end_src

*** Consult Casual
#+begin_src emacs-lisp
(use-package casual
  :straight (casual :type git :host github :repo "kickingvegas/casual")
  :ensure nil)
#+end_src

** Editing
