myinit.el

(setq ispell-program-name "aspell"
      ispell-dictionary "english"
      ispell-personal-dictionary "~/.aspell.en.pws")

(add-hook 'text-mode-hook #'flyspell-mode)
(add-hook 'prog-mode-hook #'flyspell-prog-mode)

;; Free up C-. and C-; from flyspell (used by embark)
(with-eval-after-load 'flyspell
  (define-key flyspell-mode-map (kbd "C-.") nil)
  (define-key flyspell-mode-map (kbd "C-;") nil))

(use-package yasnippet :straight t
  :config
  (yas-global-mode 1)
  (define-key yas-minor-mode-map (kbd "C-c j") yas-maybe-expand)
  (define-key yas-minor-mode-map (kbd "C-c y") #'yas-expand)
  (setq yas-trigger-key "TAB"))

(use-package yasnippet-snippets :straight t :after yasnippet)

(use-package multiple-cursors :straight t)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->")         'mc/mark-next-like-this)
(global-set-key (kbd "C-<")         'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<")     'mc/mark-all-like-this)

(use-package expand-region :straight t
  :config
  (defun ha/expand-region (lines)
    "Prefix-aware wrapper around `er/expand-region'.
With no prefix: expand normally. Positive prefix: select down N lines.
Zero prefix: select current line. Negative prefix: select up N lines."
    (interactive "p")
    (cond ((= lines 1)  (er/expand-region 1))
          ((< lines 0)  (ha/expand-previous-line-as-region lines))
          (t            (ha/expand-next-line-as-region (1+ lines)))))

  (defun ha/expand-next-line-as-region (lines)
    (beginning-of-line)
    (set-mark (point))
    (end-of-line lines))

  (defun ha/expand-previous-line-as-region (lines)
    (end-of-line)
    (set-mark (point))
    (beginning-of-line (1+ lines)))

  :bind ("C-=" . ha/expand-region))

(use-package smartparens :straight t
  :config
  (require 'smartparens-config)
  (add-hook 'markdown-mode-hook 'turn-on-smartparens-strict-mode)
  (add-hook 'org-mode-hook      'turn-on-smartparens-strict-mode)
  ;; Org-mode pair shortcuts
  (sp-local-pair 'org-mode "\\[" "\\]")
  (sp-local-pair 'org-mode "$" "$")
  (sp-local-pair 'org-mode "'" "'" :actions '(rem))
  (sp-local-pair 'org-mode "=" "=" :actions '(rem))
  (sp-local-pair 'org-mode "\\left("  "\\right)"  :trigger "\\l(" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (sp-local-pair 'org-mode "\\left["  "\\right]"  :trigger "\\l[" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (sp-local-pair 'org-mode "\\left\\{" "\\right\\}" :trigger "\\l{" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (sp-local-pair 'org-mode "\\left|"  "\\right|"  :trigger "\\l|" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (smartparens-global-mode t)
  (show-smartparens-global-mode t))

;; Aggressive indentation (keeps code always indented)
(use-package aggressive-indent :straight t)

;; Hungry delete — remove all whitespace in one delete keystroke
(use-package hungry-delete :straight t
  :config (global-hungry-delete-mode))

;; Comment smarter
(use-package comment-dwim-2 :straight t
  :bind ("M-;" . comment-dwim-2))

;; Drag lines/regions up and down
(use-package drag-stuff :straight t
  :config
  (add-hook 'prog-mode-hook #'drag-stuff-mode)
  (drag-stuff-define-keys))

;; Text folding à la Vim
(use-package vimish-fold :straight t
  :config
  (vimish-fold-global-mode 1)
  (global-set-key (kbd "C-c v f") #'vimish-fold)
  (global-set-key (kbd "C-c v v") #'vimish-fold-delete))

;; Substitute (structural find/replace)
(use-package substitute :straight t
  :config (require 'substitute))

;; Visual regexp
(use-package visual-regexp :straight t
  :config (require 'visual-regexp))

;; Abbrev mode
(setq-default abbrev-mode t)

(use-package ws-butler :straight t
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)))

;; Auto-fill in text modes
(add-hook 'text-mode-hook 'turn-on-auto-fill)

;; Hippie expand
(setq hippie-expand-try-functions-list
      '(try-expand-dabbrev-visible
        try-expand-dabbrev
        try-expand-dabbrev-all-buffers
        try-expand-dabbrev-from-kill
        try-expand-list
        try-expand-list-all-buffers
        try-complete-file-name-partially
        try-complete-file-name
        try-expand-all-abbrevs))

(use-package whitespace :straight t
  :bind ("C-c T w" . whitespace-mode)
  :init
  (setq whitespace-line-column nil
        whitespace-display-mappings
        '((space-mark   32 [183] [46])
          (newline-mark 10 [9166 10])
          (tab-mark      9 [9654 9] [92 9])))
  :config
  (set-face-attribute 'whitespace-space       nil :foreground "#666666" :background nil)
  (set-face-attribute 'whitespace-newline     nil :foreground "#666666" :background nil)
  (set-face-attribute 'whitespace-indentation nil :foreground "#666666" :background nil))

(straight-use-package 'highlight-indent-guides)
(setq highlight-indent-guides-method 'column)
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)

(straight-use-package 'rainbow-delimiters)
(require 'rainbow-delimiters)
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

(use-package rainbow-mode :straight t
  :init (add-hook 'prog-mode-hook 'rainbow-mode))
