myinit.org
** File Management (Dired)
#+begin_src emacs-lisp
(setq dired-use-ls-dired t
      insert-directory-program "gls"
      dired-listing-switches "-laGh1v --group-directories-first"
      delete-by-moving-to-trash t
      dired-dwim-target t)

(use-package all-the-icons-dired :straight t
  :hook (dired-mode . all-the-icons-dired-mode)
  :config (setq all-the-icons-dired-monochrome nil))

(use-package dired-hide-dotfiles :straight t
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (define-key dired-mode-map (kbd "C-c t") 'dired-hide-dotfiles-mode))

(use-package dired+ :straight t
  :config (require 'dired+))

(use-package dired-rainbow :straight t :defer 2
  :config
  (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
  (dired-rainbow-define html       "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
  (dired-rainbow-define xml        "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
  (dired-rainbow-define document   "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
  (dired-rainbow-define markdown   "#ffed4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
  (dired-rainbow-define database   "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
  (dired-rainbow-define media      "#de751f" ("mp3" "mp4" "mkv" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
  (dired-rainbow-define image      "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
  (dired-rainbow-define log        "#c17d11" ("log"))
  (dired-rainbow-define shell      "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
  (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
  (dired-rainbow-define compiled   "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java"))
  (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
  (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
  (dired-rainbow-define packaged   "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
  (dired-rainbow-define encrypted  "#ffed4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
  (dired-rainbow-define fonts      "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
  (dired-rainbow-define partition  "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
  (dired-rainbow-define vc         "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules"))
  (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*"))

(with-eval-after-load 'dired
  (require 'dired-x))
#+end_src

** Project Management
*** Projectile
#+begin_src emacs-lisp
(use-package projectile :straight t
  :config (projectile-mode)
  :custom ((projectile-completion-system 'default))
  :bind-keymap ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects/")
    (setq projectile-project-search-path '("~/Projects/")))
  (setq projectile-switch-project-action #'projectile-dired
        projectile-verbose nil
        projectile-report-on-errors nil
        projectile-indexing-method 'native))
#+end_src

*** Bookmarks
#+begin_src emacs-lisp
(use-package bookmark+ :straight t
  :config (require 'bookmark+))

;; Restore PDF position after jumping to a bookmark
(defun my-bmk-pdf-handler-advice (bookmark)
  (bookmark-default-handler (bookmark-get-bookmark bookmark)))

(advice-add 'pdf-view-bookmark-jump-handler
            :after 'my-bmk-pdf-handler-advice)
#+end_src

** Programming
*** LSP Mode
#+begin_src emacs-lisp
;; 1. THE COMPLETION ENGINE (Company)
;; This replaces Corfu to stop the autoconfigure errors.
(use-package company
  :straight t
  :init
  (global-company-mode)
  :config
  (setq company-minimum-prefix-length 1
        company-idle-delay 0.0
        company-tooltip-align-annotations t
        company-selection-wrap-around t))

;; Optional: Adds icons and a modern look to the Company popup
(use-package company-box
  :straight t
  :hook (company-mode . company-box-mode))

;; 2. THE LSP SUITE
(use-package lsp-mode
  :straight t
  :commands (lsp lsp-deferred)
  :hook ((js-mode          . lsp)
         (js2-mode         . lsp)
         (typescript-mode  . lsp)
         (python-mode      . lsp-deferred)
         (python-ts-mode   . lsp-deferred)
         (rust-mode        . lsp)
         (rust-ts-mode     . lsp)
         (go-mode          . lsp-deferred)
         (go-ts-mode       . lsp-deferred)
         (c-mode           . lsp)
         (c-ts-mode        . lsp)
         (c++-mode         . lsp)
         (c++-ts-mode      . lsp)
         (java-mode        . lsp-deferred)
         (java-ts-mode     . lsp-deferred))
  :init
  ;; Move the silence flags to the very top of :init
  (setq lsp-warn-no-matched-clients nil)
  (setq lsp-log-io nil)
  (setq lsp-completion-provider :company
        lsp-rust-server 'rust-analyzer
        lsp-headerline-breadcrumb-enable t
        lsp-idle-delay 0.1
        gc-cons-threshold (* 100 1024 1024)
        read-process-output-max (* 1024 1024))
  :config
  ;; Explicitly define enabled/disabled to stop the "searching" noise
  (setq lsp-enabled-clients '(gopls jdtls clangd pylsp rust-analyzer ruff))
  (setq lsp-disabled-clients '(rls semgrep-ls))

  ;; Use clippy for Rust to avoid the 'no library targets' error
  (setq lsp-rust-analyzer-cargo-watch-command "clippy")

  (define-key lsp-mode-map (kbd "C-c i") lsp-command-map)
  (lsp-enable-which-key-integration t))

;; 3. UI, SNIPPETS, AND DIAGNOSTICS
(with-eval-after-load 'lsp-mode
  (add-hook 'lsp-mode-hook #'lsp-ui-mode)
  (add-hook 'lsp-mode-hook #'flycheck-mode)
  (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
  (yas-global-mode))

(use-package lsp-ui
  :straight t
  :commands lsp-ui-mode
  :config
  (setq lsp-ui-doc-enable t
        lsp-ui-doc-position 'at-point
        lsp-ui-sideline-enable t))
#+end_src
*** LSP UI
#+begin_src emacs-lisp
(use-package lsp-ui :straight t
  :commands lsp-ui-mode
  :custom
  (lsp-ui-sideline-show-diagnostics t)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-sideline-show-code-actions nil)
  (lsp-ui-sideline-update-mode 'line)
  (lsp-ui-sideline-delay 0)
  (lsp-ui-peek-enable t)
  (lsp-ui-peek-show-directory nil)
  (lsp-ui-doc-enable t)
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-delay 0.2)
  (lsp-ui-imenu-window-width 0)
  (lsp-ui-imenu--custom-mode-line-format nil)
  :hook (lsp-mode . lsp-ui-mode))

(use-package lsp-treemacs :straight t :after lsp
  :config (lsp-treemacs-sync-mode 1))

(use-package consult-lsp :straight t)
#+end_src

*** DAP (Debug Adapter Protocol)
#+begin_src emacs-lisp
(use-package dap-mode :straight t
  :hook ((lsp-mode . dap-mode)
         (lsp-mode . dap-ui-mode))
  :config
  (dap-mode 1)
  ;; dap-cpptools is a sub-module of dap-mode; require it here after dap-mode loads
  (require 'dap-cpptools))
#+end_src
*** Flycheck
#+begin_src emacs-lisp
(use-package flycheck :straight t
  :init (add-hook 'after-init-hook 'global-flycheck-mode)
  :config
  (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

(use-package consult-flycheck :straight t
  :bind (("M-g F" . consult-flycheck)))

(use-package sideline :straight t
  :hook (flycheck-mode . sideline-mode))

(use-package sideline-flycheck :straight t
  :hook (flycheck-mode . sideline-flycheck-setup)
  :custom
  (sideline-flycheck-display-mode 'line)
  (sideline-backends-right '(sideline-flycheck)))
#+end_src

*** Tree-sitter
#+begin_src emacs-lisp
  (use-package treesit-auto :straight t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (global-treesit-auto-mode)
    (setq treesit-extra-load-path '("/usr/local/lib/tree-sitter" "/usr/local/lib"))
    (setq treesit-auto-langs '(python java c c++ rust html css json)) ; Add the ones you use
    ;; Add these manually since the auto-function failed
    (add-to-list 'major-mode-remap-alist '(python-mode . python-ts-mode))
    (add-to-list 'major-mode-remap-alist '(java-mode   . java-ts-mode))
    (add-to-list 'major-mode-remap-alist '(c-mode      . c-ts-mode))
    (add-to-list 'major-mode-remap-alist '(c++-mode    . c++-ts-mode))
    (add-to-list 'major-mode-remap-alist '(go-mode     . go-ts-mode))) ;; This does the remapping automatically)
#+end_src

