myinit.org
*** Eglot (for grammar/prose via harper-ls)
#+begin_src emacs-lisp
#+end_src

*** Line Numbers (programming modes only)
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook #'(lambda () (display-line-numbers-mode 1)))
#+end_src

*** Eldoc
#+begin_src emacs-lisp
(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
(add-hook 'ielm-mode-hook       'turn-on-eldoc-mode)
(setq eldoc-idle-delay 0.1
      eldoc-echo-area-use-multiline-p nil)
#+end_src

*** Language: C/C++
#+begin_src emacs-lisp
(use-package ggtags :straight t
  :config
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                (ggtags-mode 1)))))

(setq lsp-clients-clangd-executable "/usr/local/bin/clangd19")
#+end_src

*** Language: Rust
#+begin_src emacs-lisp
(use-package rust-mode :straight t
  :config
  (add-hook 'rust-mode-hook (lambda () (setq indent-tabs-mode nil))))

(use-package cargo :straight t
  :hook (rust-mode . cargo-minor-mode))
#+end_src

*** Language: Python
#+begin_src emacs-lisp
(setq python-shell-interpreter "/usr/local/bin/python"
      python-indent-guess-indent-offset-verbose nil)



(require 'dap-python)
(setq dap-python-debugger 'debugpy)

(use-package lsp-pyls :straight nil
  :after lsp-mode
  :init
  (setq lsp-clients-python-command "pylsp"
        lsp-pyls-disable-warning t)

  (defun my/python-lsp-start ()
    (interactive)
    (setq-local lsp-enabled-clients '(pyls))
    (setq-local lsp-disabled-clients '(jedi pyright))
    (lsp-deferred))

  (defun my/python-organize-imports ()
    (interactive)
    (when (buffer-file-name)
      (shell-command
       (format "/usr/local/bin/ruff check --select I --fix %s"
               (shell-quote-argument (buffer-file-name))))
      (revert-buffer t t t)))

  (defun my/lsp-organize-imports-dwim ()
    (interactive)
    (if (derived-mode-p 'python-mode)
        (my/python-organize-imports)
      (lsp-organize-imports)))

  (defun my/python-lsp-client-setup ()
    (setq-local lsp-enabled-clients '(pyls))
    (setq-local lsp-disabled-clients '(jedi pyright))
    (local-set-key (kbd "C-c i l") #'my/python-lsp-start))

  (add-hook 'python-mode-hook #'my/python-lsp-client-setup)
  :config
  (define-key lsp-command-map (kbd "r o") #'my/lsp-organize-imports-dwim))

;; py-autopep8 is superseded by black/ruff below but kept in case elpy is used.
(use-package py-autopep8 :straight t
  :config
  (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save))
#+end_src

*** Language: Python — Black & Ruff
Black is the formatter; Ruff is the linter (and can also format, but using
both together with black handling formatting and ruff handling linting is
the recommended workflow).

Make sure both are installed in your Python environment first:
: pip install black ruff

#+begin_src emacs-lisp
;; --- Black (formatter) ---
(use-package blacken :straight t
  :defer t)

;; --- Ruff (linter) ---
;; Ruff is configured as a flycheck checker by pointing flycheck directly
;; at the ruff executable — no extra package needed.
(with-eval-after-load 'flycheck
  (flycheck-define-checker python-ruff
    "A Python linter using ruff."
    :command ("/usr/local/bin/ruff"
              "check"
              "--output-format=concise"
              "--stdin-filename" source-original
              "-")
    :standard-input t
    :error-filter (lambda (errors)
                    (let ((errors (flycheck-sanitize-errors errors)))
                      (seq-do #'flycheck-flake8-fix-error-level errors)
                      errors))
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ": "
              (id (one-or-more upper))
              (optional " [*]")
              " "
              (message) line-end))
    :modes python-mode)

  ;; Use ruff as the primary checker in python buffers.
  (add-to-list 'flycheck-checkers 'python-ruff)
  (defun my/python-set-ruff-checker ()
    (when (derived-mode-p 'python-mode)
      (setq-local flycheck-checker 'python-ruff)))
  (add-hook 'python-mode-hook #'my/python-set-ruff-checker))

;; --- Ruff auto-fix on save ---
;; Runs after blacken formats the buffer, so the save order is:
;;   1. black  — formats code style
;;   2. ruff   — fixes lint issues (unused imports, etc.)
;;   3. delete-trailing-whitespace — final cleanup
(defun my/ruff-fix-buffer ()
  "Run ruff --fix on the current file and revert the buffer to reflect changes."
  (when (and (eq major-mode 'python-mode)
             (buffer-file-name))
    (shell-command
     (format "/usr/local/bin/ruff check --fix %s"
             (shell-quote-argument (buffer-file-name))))
    (revert-buffer t t t)))

(add-hook 'python-mode-hook
          (lambda ()
            (add-hook 'before-save-hook #'my/ruff-fix-buffer nil t)))
#+end_src

*** Language: Go
#+begin_src emacs-lisp
(use-package go-mode :straight t)

(defun my-go-mode-hook ()
  (setq gofmt-command "goimports")
  (add-hook 'before-save-hook 'gofmt-before-save)
  (unless (string-match "go" compile-command)
    (set (make-local-variable 'compile-command)
         "go build -v && go test -v && go vet"))
  (local-set-key (kbd "M-.") 'godef-jump)
  (local-set-key (kbd "M-*") 'pop-tag-mark))

(add-hook 'go-mode-hook 'my-go-mode-hook)

(use-package go-eldoc   :straight t :config (add-hook 'go-mode-hook 'go-eldoc-setup))
(use-package godoctor  :straight t)
(use-package go-guru   :straight t)

(with-eval-after-load 'lsp-mode
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection "gopls")
                    :major-modes '(go-mode go-ts-mode)
                    :priority 0
                    :server-id 'gopls)))
(use-package go-ts-mode
  :ensure nil
  :hook (go-ts-mode . lsp-deferred))
#+end_src

*** Language: Java
#+begin_src emacs-lisp
(use-package lsp-java :straight t
  :config
  (require 'lsp-java)
  (require 'dap-java)
  (add-to-list 'lsp-enabled-clients 'jdtls))
  (add-hook 'java-mode-hook #'lsp-deferred)
#+end_src

*** Language: JavaScript & TypeScript
#+begin_src emacs-lisp
(setq js-indent-level 2)

(use-package js2-mode :straight t
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'"  . js2-mode))
  (add-to-list 'auto-mode-alist '("\\.es6\\'" . js2-mode)))

(use-package typescript-mode :straight t
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (add-to-list 'lsp-enabled-clients 'ts-ls)
  (setq typescript-indent-level 2))

(defun run-typescript-file ()
  "Run the current TypeScript file using ts-node."
  (interactive)
  (shell-command (concat "npx ts-node " (buffer-file-name))))

(require 'dap-firefox)
#+end_src

*** Language: Web (HTML, CSS, SCSS)
#+begin_src emacs-lisp
(setq css-indent-offset 2)

(use-package scss-mode :straight t
  :mode "\\.scss\\'"
  :config (setq scss-compile-at-save nil))

(use-package emmet-mode :straight t
  :hook ((html-mode . emmet-mode)
         (sgml-mode . emmet-mode)
         (web-mode  . emmet-mode)
         (css-mode  . emmet-mode)
         (lsp-mode  . emmet-mode)))

(use-package prettier :straight t
  :defer t)

(use-package auto-rename-tag :straight t
  :hook ((html-mode . auto-rename-tag-mode)
         (web-mode  . auto-rename-tag-mode)))
#+end_src

*** Language: Scheme (Geiser)
#+begin_src emacs-lisp
(use-package geiser-mit :straight t)
(require 'geiser-mit)
#+end_src

*** Language: Octave
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.m$" . octave-mode))
(add-hook 'octave-mode-hook
          (lambda ()
            (abbrev-mode 1)
            (auto-fill-mode 1)
            (when (eq window-system 'x)
              (font-lock-mode 1))))
#+end_src

*** Miscellaneous Programming Tools
#+begin_src emacs-lisp
(use-package dumb-jump :straight t :config (dumb-jump-mode))
(use-package htmlize :straight t)
(use-package crux :straight t)
(use-package editorconfig :straight t
  :config (editorconfig-mode 1))

(use-package apheleia :straight t
  :config
  (setf (alist-get 'python-mode apheleia-mode-alist) '(black))
  (setf (alist-get 'python-ts-mode apheleia-mode-alist) '(black))
  (setf (alist-get 'js2-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'js-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'typescript-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'css-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'html-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'web-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'go-mode apheleia-mode-alist) '(gofmt))
  (apheleia-global-mode +1))

(use-package envrc :straight t
  :config
  (envrc-global-mode))
#+end_src

** Org Mode
