myinit.el
(setq org-id-link-to-org-use-id 'create-if-interactive)

;; Files
(setq org-agenda-files '("~/gtd/tasks.org"
                          "~/gtd/habits.org"
                          "~/gtd/goals.org"
                          "~/gtd/birthdays.org"
                          "~/org/inbox.org"))
(setq org-default-notes-file "~/gtd/notes.org")

;; Logging & clocking
(setq org-habit-show-all-today t
      org-agenda-start-with-log-mode t
      org-log-done 'time
      org-log-into-drawer t
      org-log-reschedule 'time
      org-clock-into-drawer "CLOCKING"
      org-clock-sound "~/sounds/Smallbell.wav")

;; Agenda
(setq org-agenda-start-on-weekday 0
      org-agenda-include-diary t
      diary-display-function #'diary-fancy-display)
(add-hook 'diary-list-entries-hook #'diary-include-other-diary-files)
(add-hook 'diary-list-entries-hook #'diary-sort-entries t)

;; Refile
(setq org-refile-targets '((nil :maxlevel . 9)
                            (org-agenda-files :maxlevel . 3)
                            (org-buffer-list :maxlevel . 2))
      org-outline-path-complete-in-steps nil
      org-refile-use-outline-path 'file
      org-refile-allow-creating-parent-nodes 'confirm)
(advice-add 'org-refile :after 'org-save-all-org-buffers)

;; General behaviour
(setq org-export-with-smart-quotes t
      org-src-fontify-natively t
      org-src-window-setup 'current-window
      org-src-preserve-indentation t
      org-confirm-babel-evaluate nil
      org-startup-indented t
      org-cycle-include-plain-lists 'integrate
      org-return-follows-link t
      org-enforce-todo-dependencies t
      org-track-ordered-property-with-tag t
      org-agenda-dim-blocked-tasks t
      org-enforce-todo-checkbox-dependencies t
      org-attach-use-inheritance t
      org-use-property-inheritance t
      org-link-frame-setup '((file . find-file))
      org-catch-invisible-edits 'show-and-error
      org-M-RET-may-split-line nil
      org-alphabetical-lists t
      org-ellipsis " ▼"
      org-export-backends '(ascii beamer html latex md))

(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook 'org-cdlatex-mode)

;; Habits
(require 'org-habit)
(add-to-list 'org-modules 'org-habit)
(setq org-habit-graph-column 60)

;; Emphasis (green bold)
(add-to-list 'org-emphasis-alist '("*" (:foreground "green")))

;; Latex preview
(setq org-latex-create-formula-image-program 'dvipng)

(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-switchb)
(global-set-key (kbd "<f11>")   'org-clock-goto)
(global-set-key (kbd "C-<f11>") 'org-clock-in)
(global-set-key (kbd "M-<f11>") 'org-clock-out)

(setq org-todo-keywords
      '((sequence "REPEAT(r)" "NEXT(n@/!)" "TODO(t@/!)" "WAITING(w@/!)"
                  "SOMEDAY(s@/!)" "PROJ(p)" "|" "DONE(d@)" "CANCELLED(c@)")))

(setq org-todo-keyword-faces
      '(("TODO"      :foreground "red"     :weight bold)
        ("NEXT"      :foreground "#00ffff" :weight bold)
        ("REPEAT"    :foreground "magenta" :weight bold)
        ("WAITING"   :foreground "orange"  :weight bold)
        ("SOMEDAY"   :foreground "cyan"    :weight bold)
        ("PROJ"      :foreground "#ffc252" :weight bold)
        ("DONE"      :foreground "green"   :weight bold)
        ("CANCELLED" :foreground "yellow"  :weight bold)))

(setq org-tag-alist
      '((:startgroup)
        (:endgroup)
        ("@errand" . ?E)
        ("@home"   . ?H)
        ("@work"   . ?W)
        ("agenda"  . ?a)
        ("planning". ?p)
        ("publish" . ?P)
        ("batch"   . ?b)
        ("note"    . ?n)
        ("idea"    . ?i)))

(setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))
          (tags-todo "ACTIVE"
                     ((org-agenda-overriding-header "Active Projects")))))

        ("n" "Next Tasks"
         ((todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))))

        ("W" "Work Tasks" tags-todo "+work-email")

        ("e" "Low Effort Next Actions"
         tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
         ((org-agenda-overriding-header "Low Effort Tasks")
          (org-agenda-max-todos 20)
          (org-agenda-files org-agenda-files)))

        ("w" "Workflow Status"
         ((todo "WAITING"  ((org-agenda-overriding-header "Waiting on External")
                             (org-agenda-files org-agenda-files)))
          (todo "TODO"     ((org-agenda-overriding-header "TODO")
                             (org-agenda-files org-agenda-files)))
          (todo "SOMEDAY"  ((org-agenda-overriding-header "Someday")
                             (org-agenda-todo-list-sublevels nil)
                             (org-agenda-files org-agenda-files)))
          (todo "PROJ"     ((org-agenda-overriding-header "Project Backlog")
                             (org-agenda-todo-list-sublevels nil)
                             (org-agenda-files org-agenda-files)))
          (todo "NEXT"     ((org-agenda-overriding-header "Ready for Action")
                             (org-agenda-files org-agenda-files)))
          (tags-todo "ACTIVE" ((org-agenda-overriding-header "Active Projects")
                                (org-agenda-files org-agenda-files)))
          (todo "DONE"     ((org-agenda-overriding-header "Completed Items")
                             (org-agenda-files org-agenda-files)))
          (todo "CANCELLED" ((org-agenda-overriding-header "Cancelled")
                              (org-agenda-files org-agenda-files)))))))

(setq org-capture-templates
      '(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp "~/gtd/tasks.org" "Inbox")
         (file "~/gtd/tpl-todo.txt"))

        ("d" "Daily Plan")
        ("dp" "Plan" entry (file+olp+datetree "~/gtd/dailyplan.org")
         (file "~/gtd/tpl-dailyplan.txt"))

        ("j" "Journal Entries")
        ("jj" "Journal" entry (file+olp+datetree "~/gtd/Journal.org")
         "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
         :clock-in :clock-resume :empty-lines 1)

        ("n" "Notes")
        ("nn" "Note" entry (file+headline "~/gtd/notes.org" "Notes")
         "* %?   \n  %i\n  %u\n  %a")

        ("l" "Links")
        ("ll" "Link" entry (file+headline "~/gtd/links.org" "Links")
         "* %? %^L %^g \n%T" :prepend t)

        ("g" "Goals")
        ("gg" "Goal" entry (file+headline "~/gtd/goals.org" "Goals")
         (file "~/gtd/tpl-goal.org"))

        ("p" "Projects")
        ("pp" "Project" entry (file+headline "~/gtd/tasks.org" "Projects")
         (file "~/gtd/tpl-projects.txt"))

        ("b" "Books")
        ("bb" "Book" entry (file+headline "~/gtd/tasks.org" "Books to read")
         (file "~/gtd/tpl-book.txt") :empty-lines-after 2)

        ("s" "Someday")
        ("ss" "Someday" entry (file+headline "~/gtd/tasks.org" "Someday")
         "* %i%? \n %U")

        ("w" "Waiting")
        ("ww" "Waiting" entry (file+headline "~/gtd/tasks.org" "Waiting")
         (file "~/gtd/tpl-waiting.txt"))))

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
