myinit.el

;; Load all non-jupyter languages immediately.
;; ob-jupyter is only available after the jupyter package loads, so adding
;; jupyter here eagerly causes a "no such file" error at startup.
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python     . t)
   (js         . t)
   (ruby       . t)
   (shell      . t)))

;; Once jupyter has loaded, register ob-jupyter with babel.
(with-eval-after-load 'jupyter
  (org-babel-do-load-languages
   'org-babel-load-languages
   (append org-babel-load-languages '((jupyter . t)))))

(straight-use-package 'org-contrib)

;; Bullets
(straight-use-package 'org-superstar)
(require 'org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
(org-superstar-configure-like-org-bullets)

;; Clip URLs as org links
(straight-use-package 'org-cliplink)
(global-set-key (kbd "C-x p i") 'org-cliplink)

;; Export to Twitter Bootstrap HTML
(straight-use-package 'ox-twbs)

;; Export to reveal.js presentations
(straight-use-package 'org-re-reveal)
(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/"
      org-reveal-mathjax t)

;; Web tools (URL → org content)
(use-package org-web-tools :straight t)

;; Open agenda on startup
(add-hook 'after-init-hook 'org-agenda-list)

(defhydra hydra-org (:color blue :timeout 12 :columns 4)
  "Org clock commands"
  ("i" (lambda () (interactive) (org-clock-in '(4))) "Clock in")
  ("o" org-clock-out "Clock out")
  ("q" org-clock-cancel "Cancel clock")
  ("<f10>" org-clock-in-last "Clock in last task")
  ("j" (lambda () (interactive) (org-clock-goto '(4))) "Go to clock"))
(global-set-key (kbd "<f10>") 'hydra-org/body)

(defun my/org-agenda-list-current-buffer ()
  "Run org-agenda scoped to the current buffer only."
  (interactive)
  (let ((org-agenda-files (list (buffer-file-name (current-buffer)))))
    (call-interactively #'org-agenda)))

(defun my/copy-idlink-to-clipboard ()
  "Create an org ID for the current heading and copy the link to the kill ring.
Works in org-mode and org-agenda buffers."
  (interactive)
  (when (eq major-mode 'org-agenda-mode)
    (org-agenda-show)
    (org-agenda-goto))
  (when (eq major-mode 'org-mode)
    (let* ((head (nth 4 (org-heading-components)))
           (id   (funcall 'org-id-get-create))
           (link (format "[[id:%s][%s]]" id head)))
      (kill-new link)
      (message "Copied %s to kill ring" link))))

(defun org-reset-checkbox-state-maybe ()
  "Reset all checkboxes in an entry if RESET_CHECK_BOXES property is set."
  (interactive "∗")
  (when (org-entry-get (point) "RESET_CHECK_BOXES")
    (org-reset-checkbox-state-subtree)))

(defun org-checklist ()
  (when (member org-state org-done-keywords)
    (org-reset-checkbox-state-maybe)))

(add-hook 'org-after-todo-state-change-hook 'org-checklist)

(use-package emacsql-sqlite3 :straight t
  :config (require 'emacsql-sqlite3))

(use-package org-roam :straight t
  :init (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/RoamNotes")
  (org-roam-completion-everywhere t)
  (org-roam-dailies-directory "journal")
  (org-roam-database-connector 'sqlite3)
  (org-roam-capture-templates
   '(("b" "book notes" plain
      "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("p" "project" plain
      "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
      :unnarrowed t)
     ("d" "default" plain "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
      :unnarrowed t)))
  (org-roam-dailies-capture-templates
   '(("d" "default" entry "* %<%I:%M %p>: %?"
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n I" . org-roam-node-insert-immediate)
         ("C-c n p" . my/org-roam-find-project)
         ("C-c n b" . my/org-roam-capture-inbox)
         ("C-c n t" . my/org-roam-capture-task)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap ("C-c n d" . org-roam-dailies-map)
  :config
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
          (org-roam-capture-templates
           (list (append (car org-roam-capture-templates) '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode))

;; Roam helper functions
(defun my/org-roam-filter-by-tag (tag-name)
  (lambda (node) (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-project-finalize-hook ()
  "Add captured project file to `org-agenda-files' on confirmed capture."
  (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
  (unless org-note-abort
    (with-current-buffer (org-capture-get :buffer)
      (add-to-list 'org-agenda-files (buffer-file-name)))))

(defun my/org-roam-find-project ()
  (interactive)
  (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
  (org-roam-node-find nil nil (my/org-roam-filter-by-tag "Project")
   :templates
   '(("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                         "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
      :unnarrowed t))))

(defun my/org-roam-capture-inbox ()
  (interactive)
  (org-roam-capture- :node (org-roam-node-create)
                     :templates '(("i" "inbox" plain "* %?"
                                   :if-new (file+head "Inbox.org" "#+title: Inbox\n")))))

(defun my/org-roam-capture-task ()
  (interactive)
  (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
  (org-roam-capture-
   :node (org-roam-node-read nil (my/org-roam-filter-by-tag "Project"))
   :templates '(("p" "project" plain "** TODO %?"
                 :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                        "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                        ("Tasks"))))))

(defun my/org-roam-copy-todo-to-today ()
  (interactive)
  (let ((org-refile-keep t)
        (org-roam-dailies-capture-templates
         '(("t" "tasks" entry "%?"
            :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
        (org-after-refile-insert-hook #'save-buffer)
        today-file pos)
    (save-window-excursion
      (setq today-file (buffer-file-name))
      (setq pos (point)))
    (unless (equal (file-truename today-file)
                   (file-truename (buffer-file-name)))
      (org-refile nil nil (list "Tasks" today-file nil pos)))))

(add-to-list 'org-after-todo-state-change-hook
             (lambda ()
               (when (equal org-state "DONE")
                 (my/org-roam-copy-todo-to-today))))
