myinit.el

(use-package pdf-tools :straight t
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :init (pdf-tools-install)
  :config
  (setq pdf-view-auto-refresh-on-file-change t))

(use-package pdf-view-restore :straight t
  :after pdf-tools
  :config (add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode))

(use-package djvu :straight t :config (require 'djvu))
(straight-use-package '(djvu3 :type git :host github :repo "dalanicolai/djvu3"))
(require 'djvu3)

(use-package nov :straight t :config (require 'nov))

(use-package org-pdftools :straight t
  :hook (org-mode . org-pdftools-setup-link))

;; org-noter-pdftools must be declared BEFORE org-noter so it is available
;; when org-noter's config runs.  The :after clause still prevents it from
;; activating until both dependencies are ready.
(use-package org-noter-pdftools :straight t
  :after (org-noter org-pdftools)
  :config
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    "Insert a precise org-noter note at point in the PDF."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions
            (if toggle-no-questions
                (not org-noter-insert-note-no-questions)
              org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freepointer-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions
              #'org-noter-pdftools-jump-to-note)))

;; org-noter is declared after org-noter-pdftools so straight.el has already
;; registered the pdftools package before this :config block executes.
(use-package org-noter :straight t
  :after (org-pdftools)
  :config
  (setq org-noter-auto-save-last-location t)
  ;; Wire up the pdftools integration now that both packages are present.
  (with-eval-after-load 'org-noter-pdftools
    (require 'org-noter-pdftools)))

(use-package zmq :straight t :config (require 'zmq))

;; :defer t ensures exec-path is fully set before jupyter tries to call
;; the jupyter shell command to retrieve kernelspecs.
(use-package jupyter :straight t :defer t)

(use-package ein :straight t
  :bind ("<f9>" . ein:worksheet-execute-cell-and-goto-next-km))

(straight-use-package
 '(org-timeblock :type git :host github :repo "ichernyshovvv/org-timeblock"))

(defvar yt-iframe-format
  (concat "<iframe width=\"440\""
          " height=\"335\""
          " src=\"https://www.youtube.com/embed/%s\""
          " frameborder=\"0\""
          " allowfullscreen>%s</iframe>"))

(org-add-link-type
 "yt"
 (lambda (handle)
   (browse-url (concat "https://www.youtube.com/embed/" handle)))
 (lambda (path desc backend)
   (cl-case backend
     (html  (format yt-iframe-format path (or desc "")))
     (latex (format "\\href{%s}{%s}" path (or desc "video"))))))

(use-package magit
  :init (use-package transient
          :straight (transient :type git :host github :repo "magit/transient"))
  :bind ("C-x g" . magit-status))

(use-package git-gutter :straight t
  :init (global-git-gutter-mode +1))
(custom-set-variables '(git-gutter:update-interval 2))

(defhydra hydra-git-gutter (:body-pre (git-gutter-mode 1) :hint nil)
  "
Git gutter:
  _j_: next hunk        _s_tage hunk     _q_uit
  _k_: previous hunk    _r_evert hunk    _Q_uit and deactivate git-gutter
  ^ ^                   _p_opup hunk
  _h_: first hunk
  _l_: last hunk        set start _R_evision
"
  ("j" git-gutter:next-hunk)
  ("k" git-gutter:previous-hunk)
  ("h" (progn (goto-char (point-min)) (git-gutter:next-hunk 1)))
  ("l" (progn (goto-char (point-min)) (git-gutter:previous-hunk 1)))
  ("s" git-gutter:stage-hunk)
  ("r" git-gutter:revert-hunk)
  ("p" git-gutter:popup-hunk)
  ("R" git-gutter:set-start-revision)
  ("q" nil :color blue)
  ("Q" (progn (git-gutter-mode -1)
              (sit-for 0.1)
              (git-gutter:clear))
   :color blue))

(straight-use-package 'git-timemachine)

(use-package auctex
  :straight (auctex :type git :host nil :repo "https://git.savannah.gnu.org/git/auctex.git")

  :config
  (setq TeX-engine 'xetex
        TeX-view-program-selection '((output-pdf "PDF Tools")))
  (add-hook 'latex-mode-hook #'TeX-fold-mode))

(use-package cdlatex :straight t
  :hook (latex-mode-hook . cdlatex-mode)
  :config
  (define-key cdlatex-mode-map (kbd "TAB")     'cdlatex-tab)
  (define-key cdlatex-mode-map (kbd "C-c C-e") 'cdlatex-environment)
  (define-key cdlatex-mode-map (kbd "C-c C-s") 'cdlatex-sub-sup-mode))

(use-package vterm :straight t
  :commands vterm
  :config (setq vterm-max-scrollback 10000))

(use-package vterm-toggle :straight t
  :after vterm
  :bind (("C-`" . vterm-toggle)
         ("C-M-`" . vterm-toggle-cd))
  :custom
  (vterm-toggle-fullscreen-p nil)
  (vterm-toggle-reset-window-configuration-after-exit t))

(defun efs/configure-shell ()
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
  (setq eshell-history-size 10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt :straight t)

(use-package eshell :straight t
  :hook (eshell-first-time-mode . efs/configure-shell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t
          eshell-visual-commands '("htop" "zsh" "vim")))
  (eshell-git-prompt-use-theme 'powerline))

(use-package term :straight t
  :config (setq explicit-shell-file-name "zsh"))

(use-package eterm-256color :straight t
  :hook (term-mode . eterm-256color-mode))

(defun my-zsh ()
  "Open a zsh shell in ansi-term."
  (interactive)
  (ansi-term "zsh"))
