myinit.org
*** Elfeed
#+begin_src emacs-lisp
(defhydra hydra-elfeed ()
  "Elfeed filters"
  ("S" (elfeed-search-set-filter "@6-month-ago +systemcrafters") "System Crafters")
  ("h" (elfeed-search-set-filter "@6-month-ago +hackernews")     "Hacker News")
  ("l" (elfeed-search-set-filter "@6-month-ago +lobsters")       "Lobsters")
  ("m" (elfeed-search-set-filter "@6-month-ago +Math")           "Math")
  ("c" (elfeed-search-set-filter "@6-months-ago +cs")            "CS")
  ("e" (elfeed-search-set-filter "@6-months-ago +emacs")         "Emacs")
  ("B" (elfeed-search-set-filter "@6-months-ago +BSD")           "BSD")
  ("p" (elfeed-search-set-filter "@6-months-ago +programming")   "Programming")
  ("*" (elfeed-search-set-filter "@6-months-ago +star")          "Starred")
  ("M" elfeed-toggle-star "Mark")
  ("A" (elfeed-search-set-filter "@6-months-ago") "All")
  ("T" (elfeed-search-set-filter "@1-day-ago")    "Today")
  ("Q" bjm/elfeed-save-db-and-bury "Quit" :color blue)
  ("q" nil "dismiss" :color blue))

(use-package elfeed :straight t
  :bind (:map elfeed-search-mode-map
              ("q" . bjm/elfeed-save-db-and-bury)
              ("Q" . bjm/elfeed-save-db-and-bury)
              ("m" . elfeed-toggle-star)
              ("M" . elfeed-toggle-star)
              ("j" . hydra-elfeed/body)
              ("J" . hydra-elfeed/body)))

(use-package elfeed-goodies :straight t
  :config (elfeed-goodies/setup))

(use-package elfeed-org :straight t
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files '("~/elfeed/elfeed.org")
        elfeed-db-directory "~/elfeed/elfeeddb"))

(defalias 'elfeed-toggle-star
  (elfeed-expose #'elfeed-search-toggle-all 'star))

(defun bjm/elfeed-load-db-and-open ()
  "Load elfeed db from disk and open elfeed."
  (interactive)
  (elfeed-db-load)
  (elfeed)
  (elfeed-search-update--force))

(defun bjm/elfeed-save-db-and-bury ()
  "Save elfeed db to disk and bury the buffer."
  (interactive)
  (elfeed-db-save)
  (quit-window))

(defun elfeed-mark-all-as-read ()
  (interactive)
  (mark-whole-buffer)
  (elfeed-search-untag-all-unread))
#+end_src

*** Hacker News
#+begin_src emacs-lisp
(use-package hackernews :straight t)
(use-package hnreader :straight t)
#+end_src

*** Reddit (md4rd)
#+begin_src emacs-lisp
(use-package md4rd :straight t
  :config
  (setq md4rd-subs-active
        '(emacs math freebsd bsd compsci askcomputerscience computerarchitecture
          programming learnprogramming vim learnmath cprog c_language c_programming
          cplusplus python learnpython java javascript ruby rust learnrust lisp
          artificial machinelearning neuralnetworks linearalgebra explainlikeimfive
          css react webdev latex technology)))
#+end_src

** Writing & Reference
*** Olivetti (focused writing)
#+begin_src emacs-lisp
(use-package olivetti :straight t)
#+end_src

*** Define Word & Thesaurus
#+begin_src emacs-lisp
(use-package define-word :straight t :defer t
  :bind (("C-c d" . define-word-at-point)
         ("C-c D" . define-word))
  :config (setq define-word-default-service 'webster))

(use-package powerthesaurus :straight t)
#+end_src

*** Denote (simple notes)
#+begin_src emacs-lisp
(use-package denote :straight t
  :config
  (require 'denote)
  (setq denote-directory (expand-file-name "~/denote/notes/")))
#+end_src

*** Hyperbole
#+begin_src emacs-lisp
(use-package hyperbole :straight t
  :init
  (load "hyperbole-autoloads")
  (load "hyperbole")
  :config
  (require 'hyperbole)
  (setq hbmap:dir-user "~/gtd/hyperbole/"
        hyrolo-file-list '("~/gtd/hyperbole/ideas.org")
        hyrolo-date-format "%Y-%m-%d %H:%M:%S"
        hyrolo-kill-buffers-after-use t)
  (global-set-key [f7] 'hyrolo-fgrep)
  :bind* ("<M-return>" . hkey-either))
#+end_src

*** Greader (text-to-speech)
#+begin_src emacs-lisp
(use-package greader :straight t)
#+end_src

*** Calfw (calendar)
#+begin_src emacs-lisp
(use-package calfw :straight t :config (require 'calfw))
(use-package calfw-org :straight t :config (require 'calfw-org))
#+end_src

*** Lorem Ipsum
#+begin_src emacs-lisp
(straight-use-package 'lorem-ipsum)
(require 'lorem-ipsum)
#+end_src

** IRC / Mail
*** ERC
#+begin_src emacs-lisp
(use-package erc :straight t
  :config
  (add-to-list 'erc-modules 'notifications)
  (require 'erc-desktop-notifications)
  (erc-update-modules)
  (setq erc-hide-list '("JOIN" "MODE" "NICK" "PART" "QUIT"
                        "324" "329" "332" "333" "353" "477")
        erc-fill-function 'erc-fill-static
        erc-fill-static-center 15
        erc-server-303-functions nil
        erc-prompt (lambda () (concat "[" (buffer-name) "]"))))

(straight-use-package 'erc-scrolltoplace)
(require 'erc-scrolltoplace)
(add-to-list 'erc-modules 'scrolltoplace)
(erc-update-modules)

(use-package erc-hl-nicks :straight t)

(defun my/erc-notify (nickname message)
  "Display a desktop notification for an ERC message."
  (let* ((channel (buffer-name))
         (nick  (erc-hl-nicks-trim-irc-nick nickname))
         (title (if (string-match-p (concat "^" nickname) channel)
                    nick
                  (concat nick " (" channel ")")))
         (msg   (s-trim (s-collapse-whitespace message))))
    (alert (concat nick ": " msg) :title title)))
#+end_src

*** ZNC
#+begin_src emacs-lisp
(straight-use-package 'znc)
#+end_src

*** GNUS / Gmail
#+begin_src emacs-lisp
(setq user-mail-address "transitive@gmail.com"
      user-full-name    "Robert Cina")

(setq gnus-select-method
      '(nnimap "gmail"
               (nnimap-address "imap.gmail.com")
               (nnimap-server-port 993)
               (nnimap-stream ssl)))

(setq auth-sources '("~/.authinfo.gpg" "~/.netrc.gpg")
      auth-source-cache-expiry nil)

(setq message-send-mail-function 'smtpmail-send-it
      smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
      smtpmail-default-smtp-server "smtp.gmail.com"
      smtpmail-smtp-server         "smtp.gmail.com"
      smtpmail-smtp-service        587
      gnus-ignored-newsgroups
      "^to\\.\\|^[0-9. ]+\\( \\w\\|$\\)\\|^[\"]\"[#'()]")
#+end_src

** Blogging
*** ox-hugo
#+begin_src emacs-lisp
(use-package ox-hugo :straight t :after ox)
#+end_src

** Utilities
*** Simple HTTPD
#+begin_src emacs-lisp
(use-package simple-httpd :straight t)
#+end_src

*** Fuzzy Finder (fzf)
#+begin_src emacs-lisp
(use-package fzf :straight t)
#+end_src

*** Linum Relative
#+begin_src emacs-lisp
(use-package linum-relative :straight t
  :config
  (defun linum-new-mode ()
    "Toggle between absolute and relative line numbers."
    (interactive)
    (if linum-mode
        (linum-relative-toggle)
      (linum-mode 1)))
  :bind ("s-k" . linum-new-mode))
#+end_src

*** Inform (interactive fiction)
#+begin_src emacs-lisp
(use-package inform :straight t :config (require 'inform))
#+end_src

*** W3M (in-Emacs browser)
#+begin_src emacs-lisp
(setq browse-url-browser-function 'browse-url-firefox)

(use-package w3m :straight t)

(defun wicked/w3m-open-current-page-in-firefox ()
  "Open the current w3m URL in Firefox."
  (interactive)
  (browse-url-firefox w3m-current-url))

(defun wicked/w3m-open-link-or-image-in-firefox ()
  "Open the link or image at point in Firefox."
  (interactive)
  (browse-url-firefox (or (w3m-anchor) (w3m-image))))

(with-eval-after-load 'w3m
  (define-key w3m-mode-map "f" 'wicked/w3m-open-current-page-in-firefox)
  (define-key w3m-mode-map "F" 'wicked/w3m-open-link-or-image-in-firefox))
#+end_src

*** Info Mode Enhancement
#+begin_src emacs-lisp
(defun my-info-copy-current-node-name (arg)
  "Copy a lispy link to the current Info node.
With prefix ARG, copy the URL to the online GNU manual instead."
  (interactive "P")
  (let* ((manual (file-name-sans-extension
                  (file-name-nondirectory Info-current-file)))
         (node Info-current-node)
         (link (if (not arg)
                   (format "(info \"(%s) %s\")" manual node)
                 (format "https://www.gnu.org/software/emacs/manual/html_node/%s/%s.html"
                         manual (if (string= node "Top")
                                    "index"
                                  (replace-regexp-in-string " " "-" node))))))
    (kill-new link)
    (message link)))

(with-eval-after-load 'info
  (define-key Info-mode-map (kbd "c") 'my-info-copy-current-node-name))
#+end_src

